[
  {
    "name": "African violet",
    "price": "59.00",
    "description": "Saintpaulias are widely cultivated as house plants. Hairy often stemless perennial herbs, used for greenhouse flowering, the blossoms providing an attractive blue, violet, purple, white, pink and even green. Flowers can be single or double, solid or striped. 'Wasp' type flowers have the upper two flower petals independently fused forming a tube. There are also compound leaves on some, that are called 'bustled'. Over 2,000 cultivars have been selected, with a very wide variety of flower and leaf colors, shapes, sizes, patterns and textures. Cultivars are classified as Large, Standard, Trailing, Semi-mini, Mini, and Micro with Micro being the smallest. Leaves long-petioled, ovate: peduncles radical (or axillary in the caulescent species), 1-5 in. high, bearing several (or 1) fls. in a loose cyme: calyx small, deeply 5-lobed; corolla wide-campanulate, tube short, the lobes elliptic, blue; perfect stamens 2; ovary hairy: caps, oblong, locuhcidally 2-valved; seeds small, ellipsoid.",
    "size": "small",
    "habit": "herbaceous",
    "image": ""
  },
  {
    "name": "Alocasia Zebrina",
    "price": "66.00",
    "description": "Alocasia (name made from Colocasia). Araceae. Warmhouse foliage plants, with green, veined and mottled, large hanging leaves. Stem thick, short or assurgent, densely marked with If.-scars: lvs. with long sheathed petioles, the blade, when young peltate, when old usually sagittate-cordate, the basal lobes commonly more or less united: spathe with the tube much shorter than the blade, ovoid or oblong, convolute, the blade oblong, usually boat-t shaped; spadix shorter than spathe. — Stove foliage plants from E. Asia, comprising about 40 species, in addition to many hybrids. Related to Caladium and Colocasia, from which separated by technical fr. characters. See Monogr. by Engler in De Candolle's Monographic Phanerogamarum, Vol. II. The species of alocasia grown in greenhouses have foliage of great beauty and coloring and rank high amongst ornamental foliage plants. The leaves are remarkable for their coloring, markings, size and shape, some of them being of a rich metallic coloring while others are green and green-and-white with prominent veining. Alocasias are propagated by suckers or cuttings of the rhizomes, placed in small pots containing a mixture of light fibrous peat and sand in equal proportions, and plunged in a close frame or propagating-box with bottom heat. They may also be grown from seeds sown in 4-inch pots, in a light peaty soil in a temperature of 75° F. The month of March is the best time for propagating and potting. The evergreen species (as A. cuprea, A. longiloba, A. Lowii, A. Regina) thrive best in a compost of two parts fibrous peat and sphagnum moss and one part lumps of fibrous loam, to which should be added a sprinkling of silver sand and a few nodules of charcoal to keep the whole sweet. The herbaceous species (as A. macrorhiza) do best in good fibrous loam to which one-third of well-rotted cow-manure or pulverized sheep-manure has been added. Perfect drainage of the pots is absolutely necessary, and, in potting, the evergreen species should be coned up 2 or 3 inches above the rim of the pot, and finished off with a surfacing of live sphagnum moss.. The season of active growth begins about the first of March, when plants should be given a temperature of 70° at night, with a rise of 15° by day, and the atmosphere must be kept in a humid condition. They should be given a position free from drafts and direct sunlight. They require an abundance of water at the roots as the leaves develop, and are greatly benefited by an occasional watering of clear liquid sheep- or cow-manure. To secure the best development of the leaves, heavy syringing should be avoided, but frequent spraying on all fine days with an atomizer sprayer is very beneficial. Towards winter the humidity of the atmosphere and the supply of water to the roots should be reduced with the evergreen species, and gradually withheld altogether as the leaves mature, with the herbaceous species. The temperature during winter should not fall below 60°.",
    "size": "medium",
    "habit": "tropical"
  },
  {
    "name": "Aloe Vera",
    "price": "95.00",
    "description": "Aloe vera, also known as the medicinal aloe, is a species of succulent plant that probably originated in Northern Africa, the Canary islands and Cape Verde. Aloe vera grows in arid climates and is widely distributed in Africa and other arid areas. The species is frequently cited as being used in herbal medicine. Aloe vera is a stemless or very short-stemmed succulent plant growing to 60–100 cm (24–39 in) tall, spreading by offsets. The leaves are thick and fleshy, green to grey-green, with some varieties showing white flecks on the upper and lower stem surfaces. The margin of the leaf is serrated and has small white teeth. The flowers are produced in summer on a spike up to 90 cm in tall, each flower pendulous, with a yellow tubular corolla 2–3 cm (0.8–1.2 in) long. Like other Aloe species, Aloe vera forms arbuscular mycorrhiza, a symbiosis that allows the plant better access to mineral nutrients in soil.",
    "size": "medium",
    "habit": "cacti-succulent"
  },
  {
    "name": "Bamboo Palm",
    "price": "105.00",
    "description": "Has long bamboo-like canes. The canes grow to form a dense clusters of fronds with, dark green to grey leaves. Chamaedorea seifrizii, resembles bamboo in appearance. It grows to about 7 feet. Usually plants sold in nurseries or seen in collections are clustering with about 20 or 30 individual plants. Each stem is long and slender with 'nodes' very similar in appearance to Bamboo. Although plants are commercially clumped together to form shrub-like specimens, this palm naturally spreads by suckers or offshoots also similar to Bamboo. The stems are tall and have about 10-15 fronds each with about 12 dark green pinnate leaflets. As the old fronds die, these should be trimmed off and the leaf bases or sheath allowed to dry out. Later these should be removed as this promotes good plant hygiene and exposes the attractive light green 'bamboo stem'.",
    "size": "tall",
    "habit": "bamboo"
  },
  {
    "name": "Bamboo",
    "price": "50.00",
    "description": "Bamboo are a group of perennial evergreen (except for certain temperate species) plants in the true grass family Poaceae, subfamily Bambusoideae, tribe Bambuseae. Giant bamboos are the largest members of the grass family. Bamboos are also the fastest growing plants in the world. They are capable of growing up to 60 centimeters (24 in.) or more per day due to a unique rhizome-dependent system. However, this astounding growth rate is highly dependent on local soil and climatic conditions. There are more than 70 genera divided into about 1,000 species. They are found in diverse climates, from cold mountains to hot tropical regions. They occur across East Asia, from 50°N latitude in Sakhalin[citation needed] through to Northern Australia, and west to India and the Himalayas. They also occur in sub-Saharan Africa, and in the Americas from the Mid-Atlantic United States south to Argentina and Chile, reaching their southernmost point anywhere, at 47°S latitude. Continental Europe is not known to have any native species of bamboo.",
    "size": "tall",
    "habit": "bamboo"
  },
  {
    "name": "Banana Tree",
    "price": "159.00",
    "description": "Adaptation Bananas and plantains are today grown in every humid tropical region and constitutes the 4th largest fruit crop of the world. The plant needs 10 - 15 months of frost-free conditions to produce a flower stalk. All but the hardiest varieties stop growing when the temperature drops below 12° C (53° F). Growth of the plant begins to slow down at about 27° C (80° F) and stop entirely when the temperature reaches 38° C (100° F). High temperatures and bright sunlight will also scorch leaves and fruit, although bananas grow best in full sun. Freezing temperatures will kill the foliage. In most areas bananas require wind protection for best appearance and maximum yield. They are also susceptible to being blown over. Bananas, especially dwarf varieties, make good container specimens if given careful attention. The plant will also need periodic repotting as the old plant dies back and new plants develop. Growth Habit: Bananas are fast-growing herbaceous perennials arising from underground rhizomes. The fleshy stalks or pseudostems formed by upright concentric layers of leaf sheaths constitute the functional trunks. The true stem begins as an underground corm which grows upwards, pushing its way out through the center of the stalk 10-15 months after planting, eventually producing the terminal inflorescence which will later bear the fruit. Each stalk produces one huge flower cluster and then dies. New stalks then grow from the rhizome. Banana plants are extremely decorative, ranking next to palm trees for the tropical feeling they lend to the landscape.",
    "size": "tall",
    "habit": "tree"
  },
  {
    "name": "Gerbera",
    "price": "83.00",
    "description": "Gerbera species bear a large capitulum with striking, two-lipped ray florets in yellow, orange, white, pink or red colours. The capitulum, which has the appearance of a single flower, is actually composed of hundreds of individual flowers. The morphology of the flowers varies depending on their position in the capitulum. The flower heads can be as small as 7 cm (Gerbera mini 'Harley') in diameter or up to 12 cm (Gerbera ‘Golden Serena’). Gerbera is very popular and widely used as a decorative garden plant or as cut flowers. The domesticated cultivars are mostly a result of a cross between Gerbera jamesonii and another South African species Gerbera viridifolia. The cross is known as Gerbera hybrida. Thousands of cultivars exist. They vary greatly in shape and size. Colours include white, yellow, orange, red, and pink. The centre of the flower is sometimes black. Often the same flower can have petals of several different colours. Gerbera is also important commercially. It is the fifth most used cut flower in the world (after rose, carnation, chrysanthemum, and tulip).[citation needed] It is also used as a model organism in studying flower formation. Gerbera contains naturally occurring coumarin derivatives. Hairy, stemless herbs. Perennials which can be treated like annualsRH. Leaves may spread or come up from a basal rosette, are entire to dentate (or rarely pinnately lobed), petiolate, and hairy underneathRH. Gerbera (pronounced /ˈdʒɜrbərə/ or Template:IPA-en) L. is a genus of ornamental plants from the sunflower family (Asteraceae).Gerbera is also commonly known as: African Daisy, Transvaal Daisy, and Barberton Daisy. The gerbera daisy, known as the ~Transvaal Daisy,~ originated in South Africa. It has approximately 30 species in the wild, extending to South America, Africa and tropical Asia. This plant is attractive to bees, butterflies and/or birds. This plant is resistant to deer.",
    "size": "small",
    "habit": "herbaceous"
  },
  {
    "name": "Basil",
    "price": "128.00",
    "description": "Basil (Ocimum basilicum) is a tender low-growing herb that is grown as a perennial in warm, tropical climates, and an annual elsewhere. Basil is originally native to Iran, India and other tropical regions of Asia, having been cultivated there for more than 5,000 years. There are many varieties of basil, that which is used in Italian food is typically called sweet basil, as opposed to Thai basil or holy basil, which are used in Asia. It grows to between 30–130 cm tall, with opposite, light green, silky leaves 3–11 cm long and 1–6 cm broad. The flowers are quite big, white in color and arranged in a terminal spike. Unusual among Lamiaceae, the four stamens and the pistil are not pushed under the upper lip of the corolla, but lay over the inferior. After entomophilous pollination, the corolla falls off and four round achenes develop inside the bilabiate calyx. The plant tastes somewhat like anise, with a strong, pungent, sweet smell. Basil is very sensitive to cold, with best growth in hot, dry conditions. While most common varieties are treated as annuals, some are perennial, including African Blue and Holy Thai basil. The word basil comes from the Greek βασιλεύς (basileus), meaning 'king'.",
    "size": "medium",
    "habit": "herbaceous"
  },
  {
    "name": "Begonia",
    "price": "157.00",
    "description": "Because of their sometimes showy flowers of white, pink, scarlet or yellow color and often attractively marked leaves, many species and innumerable hybrids and cultivars are cultivated. The genus is unusual in that species throughout the genus, even those coming from different continents, can frequently be hybridized with each other, and this has led to an enormous number of cultivars. The American Begonia Society classifies begonias into several major groups: cane-like, shrub-like, tuberous, rhizomatous, semperflorens, rex, trailing-scandent, or thick-stemmed. For the most part these groups do not correspond to any formal taxonomic groupings or phylogeny and many species and hybrids have characteristics of more than one group, or fit well into none of them.",
    "size": "small",
    "habit": "herbaceous"
  },
  {
    "name": "Bird of Paradise (Strelitzia reginae)",
    "price": "203.00",
    "description": "Strelitzia reginae is a monocotyledonous flowering plant indigenous to South Africa. Common names include Strelitzia, Crane Flower or Bird of Paradise, though these names are also collectively applied to other species in the genus Strelitzia. Its scientific name commemorates Charlotte of Mecklenburg-Strelitz, queen consort of King George III. The plant grows to 2 m ft tall, with large, strong leaves 25 - 70 cm long and 10 - 30 cm broad, produced on petioles up to 1 m in long. The leaves are evergreen and arranged in two ranks, making a fan-shaped crown. The flowers stand above the foliage at the tips of long stalks. The hard, beak-like sheath from which the flower emerges is termed the spathe. This is placed perpendicular to the stem, which gives it the appearance of a bird's head and beak; it makes a durable perch for holding the sunbirds which pollinate the flowers. The flowers, which emerge one at a time from the spathe, consist of three brilliant orange sepals and three purplish-blue petals. Two of the blue petals are joined together to form an arrow-like nectary. When the sunbirds sit to drink the nectar, the petals open to cover their feet in pollen.",
    "size": "tall",
    "habit": "herbaceous"
  },
  {
    "name": "Nephrolepis exaltata",
    "price": "122.00",
    "description": "The Sword Fern (Nephrolepis exaltata) is a species of fern in the family Lomariopsidaceae (sometimes treated in the families Davalliaceae or Oleandraceae, or in its own family, Nephrolepidaceae), native to tropical regions throughout the world. It is common in humid forests and swamps, especially in northern South America, Mexico, Central America, Florida, the West Indies, Polynesia and Africa. Also known as the Wild Boston fern, Tuber ladder fern or Fishbone fern is in the broader family of sword fern. The fronds are 50-250 cm long and 6-15 cm broad, with alternate pinnae (the small 'leaflets' on either side of the midrib), each pinna being 2-8 cm long. The pinnae are generally deltoid, as seen in the picture to the right. The pinnate vein pattern is also visible on these highly compound leaves. The edges appear slightly serrate. The species has erect fronds, but Nephrolepis exaltata cv. Bostoniensis (Boston Fern), the most commonly cultivated cultivar, has gracefully arching fronds. This mutation was discovered in a shipment of N. exaltata to Boston from Philadelphia in 1894.",
    "size": "tall",
    "habit": "fern"
  },
  {
    "name": "Nephrolepis exaltata",
    "price": "122.00",
    "description": "The Sword Fern (Nephrolepis exaltata) is a species of fern in the family Lomariopsidaceae (sometimes treated in the families Davalliaceae or Oleandraceae, or in its own family, Nephrolepidaceae), native to tropical regions throughout the world. It is common in humid forests and swamps, especially in northern South America, Mexico, Central America, Florida, the West Indies, Polynesia and Africa. Also known as the Wild Boston fern, Tuber ladder fern or Fishbone fern is in the broader family of sword fern. The fronds are 50-250 cm long and 6-15 cm broad, with alternate pinnae (the small 'leaflets' on either side of the midrib), each pinna being 2-8 cm long. The pinnae are generally deltoid, as seen in the picture to the right. The pinnate vein pattern is also visible on these highly compound leaves. The edges appear slightly serrate. The species has erect fronds, but Nephrolepis exaltata cv. Bostoniensis (Boston Fern), the most commonly cultivated cultivar, has gracefully arching fronds. This mutation was discovered in a shipment of N. exaltata to Boston from Philadelphia in 1894.",
    "size": "tall",
    "habit": "fern"
  },
  {
    "name": "Calathea",
    "price": "155.00",
    "description": "Calathea is a genus of flowering plants belonging to the family Marantaceae. They are commonly called calatheas or (like their relatives) prayer plants. About 200 species formerly assigned to Calathea are now in the genus Goeppertia. Calathea currently contains around 60 species. Native to the tropical Americas, many of the species are popular as pot plants due to their decorative leaves and, in some species, colorful inflorescences. The young leaves and bracts can retain pools of water, called phytotelmata, that provide habitat for many invertebrates.",
    "size": "medium",
    "habit": "herbaceous"
  },
  {
    "name": "Calathea",
    "price": "155.00",
    "description": "Calathea is a genus of flowering plants belonging to the family Marantaceae. They are commonly called calatheas or (like their relatives) prayer plants. About 200 species formerly assigned to Calathea are now in the genus Goeppertia. Calathea currently contains around 60 species. Native to the tropical Americas, many of the species are popular as pot plants due to their decorative leaves and, in some species, colorful inflorescences. The young leaves and bracts can retain pools of water, called phytotelmata, that provide habitat for many invertebrates.",
    "size": "medium",
    "habit": "herbaceous"
  },
  {
    "name": "Chinese Hibiscus",
    "price": "100.00",
    "description": "Hibiscus rosa-sinensis, known colloquially as the Chinese hibiscus, China rose and shoe flower, is an evergreen flowering shrub native to East Asia. It is widely grown as an ornamental plant throughout the tropics and subtropics. The flowers are large, generally red in the original varieties, and firm, but generally lack any scent. Numerous varieties, cultivars, and hybrids are available, with flower colors ranging from white through yellow and orange to scarlet and shades of pink, with both single and double sets of petals. The flowers themselves are edible and are used in salads in the Pacific Islands. An evergreen Shrub growing to 2.5m by 2.5m. It is hardy to zone 9 and is frost tender. It is in leaf all year. The flowers are hermaphrodite (have both male and female organs) and are pollinated by Insects",
    "size": "medium",
    "habit": "shrub"
  },
  {
    "name": "Cordyline",
    "price": "88.00",
    "description": "Cordyline (club-like, referring to the fleshy roots). Liliaceae. Dracena. Dracena Palm. Greenhouse plants closely related to Dracaena; planted in the open in California and similar climates. Stems tall, often woody and palm-like, bearing large crowded Lvs., to the striking variegation of which the group owes its value: fls. panicled; stamens 6; pedicels articulated; perianth 6-parted; ovary 3-celled: fr. a berry.—Cult, for the ornamental foliage. The horticultural forms and names have become very numerous. The various species are in the trade under Dracaema, which see for a key to the species of both genera combined. From Dracaena, Cordyline differs in the ovary containing several ovules in each cell, and the solitary pedicels being provided with a 3bracted involucre. In the following paragraphs, the initial D. indicates that the plant in question is known in the trade as a Dracaena",
    "size": "medium",
    "habit": "shrub"
  },
  {
    "name": "Dracaena",
    "price": "123.00",
    "description": "Dracaena (romanized form of the Ancient Greek drakaina, 'female dragon' is a genus of about 40 species of trees and succulent shrubs classified in the family Ruscaceae. The majority of the species are native in Africa, with a few in southern Asia and one in tropical Central America. Dracaena have a secondary thickening meristem in their trunk. Some species such as D. deremensis, D. fragrans, D. godseffiana, D. marginata, and D. sanderiana are popular as houseplants. Rooted stem cuttings of D. sanderiana are widely marketed in the U.S.A. as 'Lucky Bamboo', although only superficially resembling true bamboos.",
    "size": "tall",
    "habit": "tree"
  },
  {
    "name": "Ficus Alii",
    "price": "177.00",
    "description": "Ficus (pronounced /ˈfaɪkəs/) is a genus of about 850 species of woody trees, shrubs, vines, epiphytes, and hemiepiphyte in the family Moraceae. Collectively known as fig trees or figs, they are native throughout the tropics with a few species extending into the semi-warm temperate zone. The so-called Common Fig (F. carica) is a temperate species from the Middle East and eastern Europe (mostly Ukraine), which has been widely cultivated from ancient times for its fruit, also referred to as figs. The fruit of most other species are also edible though they are usually of only local economic importance or eaten as bushfood. However, they are extremely important food resources for wildlife. Figs are also of paramount cultural importance throughout the tropics, both as objects of worship and for their many practical uses. Ficus is a pan-tropical genus of trees, shrubs and vines occupying a wide variety of ecological niches; most are evergreen, but some deciduous species are endemic to areas outside of the tropics and to higher elevations. Fig species are characterized by their unique inflorescence and distinctive pollination syndrome, which utilizes wasp species belonging to the Agaonidae family for pollination. Some better known species that represent the diversity of the genus include the Common Fig which is a small temperate deciduous tree whose fingered fig leaf is well-known in art and iconography; the Weeping Fig (F. benjamina) a hemi-epiphyte with thin tough leaves on pendulous stalks adapted to its rain forest habitat; the rough-leaved sandpaper figs from Australia; the Creeping Fig (F. pumila), a vine whose small, hard leaves form a dense carpet of foliage over rocks or garden walls.",
    "size": "tall",
    "habit": "tree"
  },
  {
    "name": "Ficus Lyrata",
    "price": "178.00",
    "description": "Ficus lyrata, commonly known as the fiddle-leaf fig, is a species of fig tree, native to western Africa, from Cameroon west to Sierra Leone. It grows in lowland tropical rainforest. It is a banyan fig (Ficus subgenus Urostigma) that commonly starts life as an epiphyte high in the crown of another tree; it then sends roots down to the ground which envelop the trunk of the host tree and slowly strangles it. It can also grow as a free-standing tree on its own, growing up to 12-15 m (40-50 ft) tall. The leaves are variable in shape, but often with a broad apex and narrow middle, resembling a fiddle; they are up to 45 cm in 0 long and 30 cm in 0 broad, though usually smaller, with a leathery texture and a wavy margin. The fruit is a green fig 2.5-3 cm (1-¼ in) diameter. It is a popular ornamental tree in subtropical and tropical gardens, and is also grown as a houseplant, where it usually stays shorter when put into pots than when grown outdoors. Their main horticultural feature are their large leaves. Like other fig species, it can grow to a large tree if planted in the ground. Like all figs, it is frost tender.",
    "size": "medium",
    "habit": "tree"
  },
  {
    "name": "Geranium",
    "price": "53.00",
    "description": "Geranium (Greek, crane; from the resemblance of the fruit to a crane's bill). Geraniaceae. Cbanesbill. Generally herbaceous plants, annual, biennial, and perennial. Widely cultivated in borders, and some species in the rockery, usually caulescent. Leaves simple, alternate or opposite and much- lobed, sometimes almost radical: fls. regular; sepals 5, imbricated, often 3-nerved and mucronate; petals 5, often hairy or ciliate; stamens 10, in 2 rows; anthers 10; seeds when ripened separated from the ovary and with its awn bent sinuously. The genus Erodium, its nearest ally, has but the inner row of stamens furnished with anthers and the awn of the seed is bent spirally. The geraniums of common speech are classed in the genus Pelargonium, having at the side of the pedicel a distinct narrow tube and zygomorphic fls.",
    "size": "small",
    "habit": "herbaceous"
  },
  {
    "name": "Guava",
    "price": "53.00",
    "description": "Adaptation: The tropical guava is best adapted to the warm climate of Florida and Hawaii, although it can be grown in coastal Southern California, and with some protection, selected areas north to Mendocino County. Guavas actually thrive in both humid and dry climates, but can survive only a few degrees of frost. The tree will recover from a brief exposure to 29° F but may be completely defoliated. Young trees are particularly sensitive to cold spells. Older trees, killed to the ground, have sent up new shoots which fruited 2 years later. Guavas can take considerable neglect, withstanding temporary waterlogging and very high temperatures. They tend to bear fruit better in areas with a definite winter or cooler season. The adaptability of the guava makes it a serious weed tree in some tropical areas. The smaller guava cultivars can make an excellent container specimen.  Growth Habit: Guavas are evergreen, shallow-rooted shrubs or small trees to 33 ft, with spreading branches. Growth in California is rarely over 10 - 12 feet. The bark is smooth, mottled green or reddish brown and peels off in thin flakes to reveal the attractive 'bony' aspect of its trunk. The plant branches close to the ground and often produces suckers from roots near the base of the trunk. Young twigs are quadrangular and downy. Foliage: Guava leaves leaves are opposite, short-petioled, oval or oblong-elliptic, somewhat irregular in outline, 2 - 6 inches long and 1 - 2 inches wide. The dull-green, stiff but leathery leaves have pronounced veins, and are slightly downy on the underside. Crushed leaves are aromatic. Flowers: Faintly fragrant, the white flowers, borne singly or in clusters in the leaf axils, are 1 inch wide, with 4 or 5 white petals. These petals are quickly shed, leaving a prominent tuft of perhaps 250 white stamens tipped with pale-yellow anthers. Guavas are primarily self-fruitful, although some strains seem to produce more fruit when cross-pollinated with another variety. Guavas can bloom throughout the year in mild-winter areas, but the heaviest bloom occurs with the onset of warm weather in the spring. The exact time can vary from year to year depending on weather. The chief pollinator of guavas is the honeybee.",
    "size": "small",
    "habit": "shrub"
  },
  {
    "name": "Kumquat",
    "price": "111.00",
    "description": "Kumquats or cumquats are a group of small fruit-bearing trees in the flowering plant family Rutaceae, either forming the genus Fortunella, or placed within Citrus sensu lato. The edible fruit closely resembles that of the orange (Citrus sinensis), but it is much smaller and ovular, being approximately the size and shape of an olive. They are slow-growing evergreen shrubs or short trees, from 2.5 to 4.5 m tall, with sparse branches, sometimes bearing small thorns. The leaves are dark glossy green, and the flowers white, similar to other citrus flowers, borne singly or clustered in the leaf-axils. The kumquat tree produces 30 to 50 fruit each year.Template:Dubious The tree can be hydrophytic, with the fruit often found floating on water near shore during the ripe season. The plant is native to south Asia and the Asia-Pacific. The earliest historical reference to kumquats appears in literature of China in the 12th century. They have long been cultivated in Japan, Taiwan, the Philippines and southeast Asia. They were introduced to Europe in 1846 by Robert Fortune, collector for the London Horticultural Society, and shortly thereafter into North America.",
    "size": "small",
    "habit": "tree"
  },
  {
    "name": "Laurentii",
    "price": "111.00",
    "description": "Sansevieria trifasciata (Laurentii) is a species of Sansevieria, native to tropical west Africa. It is commonly called the snake plant, because of the shape of its leaves, or mother-in-law's tongue because of their sharpness. It is an evergreen herbaceous perennial plant forming dense stands, spreading by way of its creeping rhizome, which is sometimes above ground, sometimes underground. Its stiff leaves grow vertically from a basal rosette. Mature leaves are dark green with light gray-green cross-banding and usually range between 70–90 cm in length and 5–6 cm in width.",
    "size": "medium",
    "habit": "herbaceous"
  },
  {
    "name": "Cactus",
    "price": "139.00",
    "description": "Cactus or cacti. The plants correctly designated by this name constitute the family Cactaceae. Scarcely any group in the whole plant kingdom is more remarkable for its strange and varied forms, the beauty of its flowers, and wonderful adaptation to desert life. It is not, however, confined to desert regions; for in the moist forests of the tropics of the New World it is represented by a number of interesting forms often epiphytal or scrambling in their habit of growth, with beautiful flowers and sometimes with delicious edible fruit.",
    "size": "medium",
    "habit": "succulent"
  },
  {
    "name": "Orchid",
    "price": "168.00",
    "description": "Orchids. A vast assemblage of herbaceous plants, mostly with unusual and interesting flowers, of which about 15,000 species are at present known. This number is being augmented yearly as the regions which they inhabit become more accessible to collectors. A single collection in New Guinea in 1907 to 1909 brought to light 1,102 new species,—an indication of the number of new forms still to be expected from little-explored regions. Since the first edition of the 'Cyclopedia of American Horticulture' was published, the number of known species has been increased by about 5,000. Probably the species now outnumber those of the great, family Compositae. Although widely distributed, the orchids are seldom abundant in any place as to individual plants. They are mostly inhabitants of special or particular places. Orchids are also highly specialized in structure, particularly in character of flowers, in this differing widely from the broadly generalized structure of the Compositae.",
    "size": "small",
    "habit": "orchid"
  },
  {
    "name": "Hibiscus",
    "price": "171.00",
    "description": "Hibiscus, or rosemallow, is a large genus of about 200-220 species of flowering plants native to warm, temperate, subtropical and tropical regions throughout the world. The genus includes both annual and perennial herbaceous plants, and woody shrubs and small trees. Seven species are commonly grown, one is annual, another is a perennial that is like a shrub, two are shrubs that are decidious and three shrubs that are evergreen. These seven are cultivated primarily for their showy flowers, though one is grown mostly as food and another for its colored foliage. The leaves are alternate, simple, ovate to lanceolate, often with a toothed or lobed margin. The flowers are large, conspicuous, trumpet-shaped, with five or more petals, ranging from white to pink, red, purple or yellow, and from 4-15 cm broad. The fruit is a dry five-lobed capsule, containing several seeds in each lobe, which are released when the capsule splits open at maturity.",
    "size": "small",
    "habit": "shrub"
  },
  {
    "name": "Schefflera",
    "price": "65.00",
    "description": "Schefflera (pronounced /ˈʃɛflərə/)is a genus in the flowering plant family Araliaceae. The plants are trees, shrubs or lianas, growing 1-30 m tall, with woody stems and palmately-compound leaves. The circumscription of the genus has varied greatly. Phylogenetic studies have shown that the widely-used broad circumscription as a pantropical genus of over 700 species is polyphyletic, but it remains to be seen how this will affect the classification of the genus. Several species are grown in pots as houseplants, most commonly Schefflera actinophylla (Umbrella Tree) and Schefflera arboricola (Dwarf Umbrella Tree). Numerous cultivars have been selected for various characters, most popularly for variegated or purple foliage. Schefflera arboricola (syn. Heptapleurum arboricolum) is a plant in the Araliaceae family. It is an evergreen shrub which can reach to 3-4 m tall. The trailing stems are weak and frequently scramble over other vegetation. The leaves are palmately compound, and have 7-9 leaflets. Leaflets are 9-20 cm long and 4-10 cm across in the wild, but normally smaller when cultivated. Flowers are produced in a 20 cm panicle of small umbels, each umbel 7-10 mm diameter with 5-10 flowers.",
    "size": "small",
    "habit": "shrub"
  },
  {
    "name": "Aglaonema",
    "price": "199.00",
    "description": "Aglaonema is a genus of about 20 species of flowering plants in the family Araceae, native to the tropical swamps and rainforests of southeastern Asia from Bangladesh east to the Philippines and north to southern China. No common name is widely used, though they are sometimes called 'Chinese evergreen'. They are herbaceous perennial plants growing to 20-150 cm in height. The leaves are alternate on the stems, lanceolate to narrowly ovate, dark to medium green, 10-45 cm long and 4-16 cm broad, depending on the species. The flowers are relatively inconspicuous, white or greenish-white spathes that can give way to red berries.",
    "size": "small",
    "habit": "herbaceous"
  },
  {
    "name": "String of Pearls",
    "price": "44.00",
    "description": "Senecio rowleyanus, commonly called string-of-pearls or string-of-beads, is a flowering plant in the family Asteraceae. It is native to southwest Africa. S. rowleyanus grows long, trailing stems of spherical leaves. The flowers are pale and brushlike. It is cultivated indoors as an ornamental plant for hanging baskets. The fleshy leaves are poisonous and should not be consumed.",
    "size": "small",
    "habit": "cacti-succulent"
  },
  {
    "name": "Jasmine",
    "price": "67.00",
    "description": "Jasminium (Arabic name, from which have come Jessamine, Jasmin and Jasminum). Oleaceae. Jasmine. Jessamine. Climbing or erect shrubs, with attractive flowers, mostly very fragrant, prized for planting in mild climates and frequently grown under glass. Leaves opposite or alternate, pinnate but sometimes reduced to 1 lft.(petiole jointed): fls. on the ends of the branchlets, or twin, or in dichotomous cymes; corolla yellow or white, sometimes reddish, salver-shaped, the 4-9 or more lobes convolute in the bud, much exceeding the calyx; stamens 2, included in the corolla-tube; ovary 2-loculed, with 1-4 erect ovules: fr. a 2-lobed berry, or sometimes the carpels separate, the carpels mostly 2-seeded.—Probably upwards of 200 species, widely distributed in warm parts of Eu., Asia, Afr., and the Pacific region; nearly absent from Amer. The genus is closely allied to Ligustrum, but differs in the compound lvs. and twin-carpeled frs. Olea is also a related genus.",
    "size": "small",
    "habit": "vine-climber"
  },
  {
    "name": "Narcissus",
    "price": "89.00",
    "description": "Narcissus is the botanic name for a genus of hardy, mostly spring-flowering, bulbs. There are several Narcissus species that bloom in the autumn. Daffodil is a common English name, sometimes used now for all narcissus. They are mostly native to the Mediterranean region, but a few species are found through Central Asia to China. The range of forms in cultivation has been heavily modified and extended, with new variations available in nurseries practically every year. All Narcissus species have a central trumpet-shaped corona surrounded by a ring of petals. The traditional daffodil has a golden yellow color all over, but the corona may often feature a contrasting color such as that of a slice of lime. Breeders have developed some daffodils with a double or triple row of petals, making them resemble a small golden ball. Other cultivars have frilled petals, or an elongated or compressed central corona. Daffodils are poisonous, and if eaten could result in death",
    "size": "small",
    "habit": "bulbous"
  },
  {
    "name": "Gladiolus",
    "price": "89.00",
    "description": "Gladiolus (from Latin, the diminutive of gladius, a sword) is a genus of perennial bulbous flowering plants in the iris family (Iridaceae). Sometimes called the sword lily, the most widely used English common name for these plants is simply gladiolus (plural gladioli, gladioluses or sometimes gladiolas). The genus Gladiolus contains about 260 species, of which 250 are native to sub-Saharan Africa, mostly South Africa. About 10 species are native to Eurasia. There are 160 species of Gladiolus endemic in southern Africa and 76 in tropical Africa. The flowers of unmodified wild species vary from very small to perhaps 40 mm across, and inflorescences bearing anything from one to several flowers. The spectacular giant flower spikes in commerce are the products of centuries of hybridisation, selection, and perhaps more drastic manipulation. These attractive, perennial herbs are semihardy in temperate climates. They grow from rounded, symmetrical corms, that are enveloped in several layers of brownish, fibrous tunics. Their stems are generally unbranched, producing 1 to 9 narrow, sword-shaped, longitudinal grooved leaves, enclosed in a sheath. The lowest leaf is shortened to a cataphyll. The leaf blades can be plane or cruciform in cross section.",
    "size": "medium",
    "habit": "bulbous"
  },
  {
    "name": "Yucca Cactus",
    "price": "122.00",
    "description": "Yucca (Yuca, native name for the manihot or cassava, erroneously applied to the present plants by Gerarde). Liliaceae, tribe Yucceae. Bold stiff-leaved plants suitable for lawn planting, subtropical massing, and a few of them for flower-garden use. Acaulescent to arboreous endogens with fibrous evergreen sword-shaped lvs. usually pungent and often denticulate or fibrous on the margin: fls. white or shaded with cream or violet, cup- or saucer-shaped, usually pendent in large usually erect panicles, opening at night and then somewhat sickishly fragrant; pollination rarely occurs except through the aid of a small white moth, Pronuba yuccasella, found wherever yuccas occur wild on the continent, which deliberately gathers the pollen and thrusts it into the stigmatic chamber.",
    "size": "tall",
    "habit": "tree"
  }
]
